docs/design/aoa-balance-mode/data/mutations/c-384-as-legacy.patch
# Mutation c-384-as-legacy: a 384-byte context is treated as legacy (snapshot never read)
# Base: contracts/src/paymasters/superpaymaster/v3/SuperPaymaster.sol at 6c3a9a0e (exp/buffer-and-params). Apply from the repo root:
#   git apply docs/design/aoa-balance-mode/data/mutations/c-384-as-legacy.patch   ...   git apply -R docs/design/aoa-balance-mode/data/mutations/c-384-as-legacy.patch
# Four-column result: c-384-as-legacy.columns.log

diff --git a/contracts/src/paymasters/superpaymaster/v3/SuperPaymaster.sol b/contracts/src/paymasters/superpaymaster/v3/SuperPaymaster.sol
index 5cd72c17..433238f7 100644
--- a/contracts/src/paymasters/superpaymaster/v3/SuperPaymaster.sol
+++ b/contracts/src/paymasters/superpaymaster/v3/SuperPaymaster.sol
@@ -1413,7 +1413,7 @@ contract SuperPaymaster is BasePaymasterUpgradeable, ReentrancyGuard, ISuperPaym
         // 20k, so a parameter change executed mid-bundle cannot move it. Any other length (a 5.5.0
         // context: 352 B) has no snapshot and keeps the 5.5.0 bound.
         uint256 snap;
-        if (context.length == CTX_LEN) {
+        if (false) {
             assembly ("memory-safe") { snap := calldataload(add(context.offset, 352)) }
         }
         uint256 snapSettle = uint32(snap >> 32);
